python/PostProcessing/data/testcase1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( -0.5  0   -0.25 )
    (  0.8  0   -0.25 )
    (  0.8  0.5 -0.25 )
    ( -0.5  0.5 -0.25 )
    ( -0.5  0    0.25 )
    (  0.8  0    0.25 )
    (  0.8  0.5  0.25 )
    ( -0.5  0.5  0.25 )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (65 25 25) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (2 6 7 3)
            (6 5 4 7)
            (5 1 0 4)

        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
);

// ************************************************************************* //
