python/PostProcessing/data/testcase1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (6.67 0 0);

boundaryField
{

   
    inlet {
        type            fixedValue;
        value           uniform (6.67 0 0);
    }
    
	outlet {
        type            zeroGradient;
    }
  
    wing
	{
        type            fixedValue;
        value           uniform (0 0 0);
    }

    alula
	{
        type            fixedValue;
        value           uniform (0 0 0);
    }

    
	".*"
    {
		type			slip;
	}

}


// ************************************************************************* //
