python/PostProcessing/data/testcase1/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.375e-6;

boundaryField
{
    inlet
    {
        type            fixedValue;
		value		    uniform 1e-12;
    }

    outlet
    {
        type            zeroGradient;
    }

    wing
	{
        type            fixedValue;
        value           uniform 1e-12;
    }
    
    alula
	{
        type            fixedValue;
        value           uniform 1e-12;
    }


	".*"
	{
		type			slip;
	}
	
}


// ************************************************************************* //
